MikroElektronika/core_packages/PIC/XC8/def/PIC18LF44J50/mcu.h
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RCSTA1<RC8_9>
extern volatile __bit                   RC8_9               __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RC8_9_bit           _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RC8_92>
extern volatile __bit                   RC8_92              __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RC8_92_bit          _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RC9>
extern volatile __bit                   RC9                 __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RC9_bit             _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RC92>
extern volatile __bit                   RC92                __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RC92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RCD8>
extern volatile __bit                   RCD8                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 RCD8_bit            _BIT_ACCESS(RCSTA1,0)
// RCSTA2<RCD82>
extern volatile __bit                   RCD82               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 RCD82_bit           _BIT_ACCESS(RCSTA2,0)
// SSP1CON2<RCEN>
extern volatile __bit _DEPRECATED       RCEN                __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<RCEN2>
extern volatile __bit                   RCEN2               __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 RCEN2_bit           _BIT_ACCESS(SSP2CON2,3)
// BAUDCON1<RCIDL>
extern volatile __bit _DEPRECATED       RCIDL               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUDCON1,6)
// BAUDCON1<RCIDL1>
extern volatile __bit                   RCIDL1              __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCIDL1_bit          _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCIDL2>
extern volatile __bit                   RCIDL2              __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 RCIDL2_bit          _BIT_ACCESS(BAUDCON2,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// IPR1<RCIP>
extern volatile __bit                   RCIP                __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RCIP_bit            _BIT_ACCESS(IPR1,5)
// BAUDCON1<RCMT>
extern volatile __bit                   RCMT                __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCMT_bit            _BIT_ACCESS(BAUDCON1,6)
// BAUDCON1<RCMT1>
extern volatile __bit                   RCMT1               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCMT1_bit           _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCMT2>
extern volatile __bit                   RCMT2               __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 RCMT2_bit           _BIT_ACCESS(BAUDCON2,6)
// PORTA<RCV>
extern volatile __bit                   RCV                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RCV_bit             _BIT_ACCESS(PORTA,5)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T1CON<RD16>
extern volatile __bit _DEPRECATED       RD16                __at(0x7E69);	// @ (0xFCD * 8 + 1)
#define                                 RD16_bit            _BIT_ACCESS(T1CON,1)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x7E69);	// @ (0xFCD * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,7)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RDE>
extern volatile __bit                   RDE                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RDE_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RDPU>
extern volatile __bit                   RDPU                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 RDPU_bit            _BIT_ACCESS(PORTE,7)
// PMCONL<RDSP>
extern volatile __bit                   RDSP                __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 RDSP_bit            _BIT_ACCESS(PMCONL,0)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE6>
extern volatile __bit                   RE6                 __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 RE6_bit             _BIT_ACCESS(PORTE,6)
// PORTE<RE7>
extern volatile __bit                   RE7                 __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 RE7_bit             _BIT_ACCESS(PORTE,7)
// SSP1STAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<READ_WRITE2>
extern volatile __bit                   READ_WRITE2         __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 READ_WRITE2_bit     _BIT_ACCESS(SSP2STAT,2)
// PORTB<REFO>
extern volatile __bit                   REFO                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 REFO_bit            _BIT_ACCESS(PORTB,2)
// WDTCON<REGSLP>
extern volatile __bit                   REGSLP              __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 REGSLP_bit          _BIT_ACCESS(WDTCON,7)
// DSCONL<RELEASE>
extern volatile __bit                   RELEASE             __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 RELEASE_bit         _BIT_ACCESS(DSCONL,0)
// PORTE<REPU>
extern volatile __bit                   REPU                __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 REPU_bit            _BIT_ACCESS(PORTE,6)
// UCON<RESUME>
extern volatile __bit                   RESUME              __at(0x7B2A);	// @ (0xF65 * 8 + 2)
#define                                 RESUME_bit          _BIT_ACCESS(UCON,2)
// RCON<RI>
extern volatile __bit                   RI                  __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 RI_bit              _BIT_ACCESS(RCON,4)
// PORTA<RJPU>
extern volatile __bit                   RJPU                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RJPU_bit            _BIT_ACCESS(PORTA,7)
// REFOCON<RODIV0>
extern volatile __bit                   RODIV0              __at(0x79E8);	// @ (0xF3D * 8 + 0)
#define                                 RODIV0_bit          _BIT_ACCESS(REFOCON,0)
// REFOCON<RODIV1>
extern volatile __bit                   RODIV1              __at(0x79E9);	// @ (0xF3D * 8 + 1)
#define                                 RODIV1_bit          _BIT_ACCESS(REFOCON,1)
// REFOCON<RODIV2>
extern volatile __bit                   RODIV2              __at(0x79EA);	// @ (0xF3D * 8 + 2)
#define                                 RODIV2_bit          _BIT_ACCESS(REFOCON,2)
// REFOCON<RODIV3>
extern volatile __bit                   RODIV3              __at(0x79EB);	// @ (0xF3D * 8 + 3)
#define                                 RODIV3_bit          _BIT_ACCESS(REFOCON,3)
// REFOCON<ROON>
extern volatile __bit                   ROON                __at(0x79EF);	// @ (0xF3D * 8 + 7)
#define                                 ROON_bit            _BIT_ACCESS(REFOCON,7)
// REFOCON<ROSEL>
extern volatile __bit                   ROSEL               __at(0x79EC);	// @ (0xF3D * 8 + 4)
#define                                 ROSEL_bit           _BIT_ACCESS(REFOCON,4)
// REFOCON<ROSSLP>
extern volatile __bit                   ROSSLP              __at(0x79ED);	// @ (0xF3D * 8 + 5)
#define                                 ROSSLP_bit          _BIT_ACCESS(REFOCON,5)
// PORTA<RP0>
extern volatile __bit                   RP0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RP0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RP1>
extern volatile __bit                   RP1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RP1_bit             _BIT_ACCESS(PORTA,1)
// PORTB<RP10>
extern volatile __bit                   RP10                __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 RP10_bit            _BIT_ACCESS(PORTB,7)
// PORTC<RP11>
extern volatile __bit                   RP11                __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 RP11_bit            _BIT_ACCESS(PORTC,0)
// PORTC<RP12>
extern volatile __bit                   RP12                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 RP12_bit            _BIT_ACCESS(PORTC,1)
// PORTC<RP13>
extern volatile __bit                   RP13                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 RP13_bit            _BIT_ACCESS(PORTC,2)
// PORTC<RP17>
extern volatile __bit                   RP17                __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 RP17_bit            _BIT_ACCESS(PORTC,6)
// PORTC<RP18>
extern volatile __bit                   RP18                __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RP18_bit            _BIT_ACCESS(PORTC,7)
// PORTD<RP19>
extern volatile __bit                   RP19                __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 RP19_bit            _BIT_ACCESS(PORTD,2)
// PORTA<RP2>
extern volatile __bit                   RP2                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RP2_bit             _BIT_ACCESS(PORTA,5)
// PORTD<RP20>
extern volatile __bit                   RP20                __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 RP20_bit            _BIT_ACCESS(PORTD,3)
// PORTD<RP21>
extern volatile __bit                   RP21                __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 RP21_bit            _BIT_ACCESS(PORTD,4)
// PORTD<RP22>
extern volatile __bit                   RP22                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 RP22_bit            _BIT_ACCESS(PORTD,5)
// PORTD<RP23>
extern volatile __bit                   RP23                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 RP23_bit            _BIT_ACCESS(PORTD,6)
// PORTD<RP24>
extern volatile __bit                   RP24                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 RP24_bit            _BIT_ACCESS(PORTD,7)
// PORTB<RP3>
extern volatile __bit                   RP3                 __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 RP3_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RP4>
extern volatile __bit                   RP4                 __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 RP4_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RP5>
extern volatile __bit                   RP5                 __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 RP5_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RP6>
extern volatile __bit                   RP6                 __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 RP6_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RP7>
extern volatile __bit                   RP7                 __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 RP7_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RP8>
extern volatile __bit                   RP8                 __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 RP8_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RP9>
extern volatile __bit                   RP9                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 RP9_bit             _BIT_ACCESS(PORTB,6)
// SSP1CON2<RSEN>
extern volatile __bit _DEPRECATED       RSEN                __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<RSEN2>
extern volatile __bit                   RSEN2               __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 RSEN2_bit           _BIT_ACCESS(SSP2CON2,1)
// PORTB<RTCC>
extern volatile __bit                   RTCC                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 RTCC_bit            _BIT_ACCESS(PORTB,1)
// PIE3<RTCCIE>
extern volatile __bit                   RTCCIE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RTCCIE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<RTCCIF>
extern volatile __bit                   RTCCIF              __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 RTCCIF_bit          _BIT_ACCESS(PIR3,0)
// IPR3<RTCCIP>
extern volatile __bit                   RTCCIP              __at(0x7D28);	// @ (0xFA5 * 8 + 0)
#define                                 RTCCIP_bit          _BIT_ACCESS(IPR3,0)
// RTCCFG<RTCEN>
extern volatile __bit                   RTCEN               __at(0x79FF);	// @ (0xF3F * 8 + 7)
#define                                 RTCEN_bit           _BIT_ACCESS(RTCCFG,7)
// RTCCFG<RTCOE>
extern volatile __bit                   RTCOE               __at(0x79FA);	// @ (0xF3F * 8 + 2)
#define                                 RTCOE_bit           _BIT_ACCESS(RTCCFG,2)
// RTCCFG<RTCPTR0>
extern volatile __bit                   RTCPTR0             __at(0x79F8);	// @ (0xF3F * 8 + 0)
#define                                 RTCPTR0_bit         _BIT_ACCESS(RTCCFG,0)
// RTCCFG<RTCPTR1>
extern volatile __bit                   RTCPTR1             __at(0x79F9);	// @ (0xF3F * 8 + 1)
#define                                 RTCPTR1_bit         _BIT_ACCESS(RTCCFG,1)
// RTCCFG<RTCSYNC>
extern volatile __bit                   RTCSYNC             __at(0x79FC);	// @ (0xF3F * 8 + 4)
#define                                 RTCSYNC_bit         _BIT_ACCESS(RTCCFG,4)
// DSCONH<RTCWDIS>
extern volatile __bit                   RTCWDIS             __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 RTCWDIS_bit         _BIT_ACCESS(DSCONH,0)
// RTCCFG<RTCWREN>
extern volatile __bit                   RTCWREN             __at(0x79FD);	// @ (0xF3F * 8 + 5)
#define                                 RTCWREN_bit         _BIT_ACCESS(RTCCFG,5)
// PADCFG1<RTSECSEL0>
extern volatile __bit                   RTSECSEL0           __at(0x79E1);	// @ (0xF3C * 8 + 1)
#define                                 RTSECSEL0_bit       _BIT_ACCESS(PADCFG1,1)
// PADCFG1<RTSECSEL1>
extern volatile __bit                   RTSECSEL1           __at(0x79E2);	// @ (0xF3C * 8 + 2)
#define                                 RTSECSEL1_bit       _BIT_ACCESS(PADCFG1,2)
// SSP1STAT<RW>
extern volatile __bit                   RW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<RW2>
extern volatile __bit                   RW2                 __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 RW2_bit             _BIT_ACCESS(SSP2STAT,2)
// PORTC<RX1>
extern volatile __bit                   RX1                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RX1_bit             _BIT_ACCESS(PORTC,7)
// RCSTA1<RX9>
extern volatile __bit _DEPRECATED       RX9                 __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RCSTA1,6)
// RCSTA1<RX91>
extern volatile __bit                   RX91                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RX91_bit            _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RX92>
extern volatile __bit                   RX92                __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RX92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RX9D>
extern volatile __bit _DEPRECATED       RX9D                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RCSTA1,0)
// RCSTA1<RX9D1>
extern volatile __bit                   RX9D1               __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 RX9D1_bit           _BIT_ACCESS(RCSTA1,0)
// RCSTA2<RX9D2>
extern volatile __bit                   RX9D2               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 RX9D2_bit           _BIT_ACCESS(RCSTA2,0)
// PIE3<RXB0IE>
extern volatile __bit                   RXB0IE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RXB0IE_bit          _BIT_ACCESS(PIE3,0)
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXB1IE_bit          _BIT_ACCESS(PIE3,1)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// BAUDCON1<RXCKP>
extern volatile __bit                   RXCKP               __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 RXCKP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<RXDTP>
extern volatile __bit _DEPRECATED       RXDTP               __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 RXDTP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<RXDTP1>
extern volatile __bit                   RXDTP1              __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 RXDTP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<RXDTP2>
extern volatile __bit                   RXDTP2              __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 RXDTP2_bit          _BIT_ACCESS(BAUDCON2,5)
// DMACON1<RXINC>
extern volatile __bit                   RXINC               __at(0x7C44);	// @ (0xF88 * 8 + 4)
#define                                 RXINC_bit           _BIT_ACCESS(DMACON1,4)
// SSP1STAT<R_NOT_W1>
extern volatile __bit                   R_NOT_W1            __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_NOT_W1_bit        _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_NOT_W2>
extern volatile __bit                   R_NOT_W2            __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 R_NOT_W2_bit        _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_W>
extern volatile __bit                   R_W                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<R_W2>
extern volatile __bit                   R_W2                __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 R_W2_bit            _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_nW>
extern volatile __bit _DEPRECATED       R_nW                __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_nW2>
extern volatile __bit                   R_nW2               __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 R_nW2_bit           _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<S1>
extern volatile __bit                   S1                  __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 S1_bit              _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<S2>
extern volatile __bit                   S2                  __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 S2_bit              _BIT_ACCESS(SSP2STAT,3)
// PORTB<SCK1>
